import { CollapseProps } from "antd";
import { Text } from "../ui/forAdditionalPages/Content";

export type HelpBlock = {
    title: string;
    helpItems: CollapseProps['items'];
}

export const HelpBlocks: HelpBlock[] = [
    {
        title: "Регистрация на сайте",
        helpItems: [
            {
                key: 1,
                label: "Как зарегистрироваться на сайте?",
                children: <Text>Зайти в личный кабинет, нажать "Зарегистрироваться" заполнить форму и завершить регистрацию </Text>
            }
        ]
    },
    {
        title: "Заказ",
        helpItems: [
            {
                key: 2,
                label: "Как сделать заказ букета?",
                children: <Text>Оформить заказ букетов с доставкой Вы можете непосредственно на нашем сайте или по телефону <a style={{textDecoration: "none", fontFamily: "Inter", fontSize: 16, fontWeight: 400,color: "#FF749F" }} href="tel:+79869869996">+7 (986) 986 99 96</a> (бесплатно для РФ). Прием звонков ведется ЕЖЕДНЕВНО с 08:00 до 23:00</Text>
            },
            {
                key: 3,
                label: "Как мне внести изменения в заказ?",
                children: <Text>Вам необходимо сообщить об изменении заказа, вашему менеджеру</Text>
            },
            {
                key: 4,
                label: "В какое время можно сделать заказ?",
                children: <Text>На сайте оформление заказа работает круглосуточно. Менеджеры обрабатывают заказы с сайта и принимают звонки ежедневно с 08:00 до 23:00</Text>
            },
            {
                key: 5,
                label: "Будет ли заказанный букет в точности соответствовать его изображению на сайте?",
                children: <Text>Наши специалисты постараются составить букет, чтобы он максимально соответствовал изображению</Text>
            },
            {
                key: 6,
                label: "Можете ли вы собрать индивидуальный букет по моему заказу?",
                children: <Text>Да ,мы собрать индивидуальную композицию для Вас,например (букет по Вашему фото)</Text>
            },
            {
                key: 7,
                label: "Когда я смогу получить фотографию получателя с букетом?",
                children: <Text>Наши менеджеры пришлют вам смс уведомления о доставке (и вышлют фото с получателем). В случае отсутствия адресата, будьте уверены мы организуем повторную доставку</Text>
            },
            {
                key: 8,
                label: "Гарантируются ли конфиденциальность и безопасность информации?",
                children: <Text>Ваши персональные данные надёжно защищены </Text>
            }
        ]
    },
    {
        title: "Оплата заказа",
        helpItems: [
            {
                key: 9,
                label: "Как можно оплатить заказ?",
                children: <Text>Оплатить ваш заказ вы можете любым удобным для Вас способом: Банковской картой ( Visa, MasterCard, МИР ) , (Альфа банк , Сбербанк,Тиньков)Электронной платежной системой: (Robokassa, Qiwi-кошелек, Билайн, МТС и т.д.) – не доступно</Text>
            },
            {
                key: 10,
                label: "Почему долго не проходит оплата моего заказа?",
                children: <Text>Это может в связи большим количеством заказов,наши менеджеры могут не успевать во время отвечать на ваши заявки</Text>
            },
            {
                key: 11,
                label: "В какой валюте можно оплатить заказ? Можно ли оплатить заказ из-за границы?",
                children: <Text>Оплата производится в рублях. Также вы можете оплатить заказ и заграницы, но только в рублях</Text>
            }
        ]
    },
    {
        title: "Доставка заказа",
        helpItems: [
            {
                key: 12,
                label: "Какие сроки доставки цветов?",
                children: <Text>При предварительном оформлении заказа не менее чем за 2 часа до доставки, мы доставим ваш заказ к точному времени и дате. Работает круглосуточная доставка</Text>
            },
            {
                key: 13,
                label: "Звоните ли вы получателю перед доставкой? Что будет, если получателя не окажется по адресу доставки?",
                children: <Text>Да, перед доставкой мы звоним получателю. Если вы не хотите, чтобы мы уведомляли получателя - укажите это при оформлении заказа или напишите менеджеру. В случае отсутствия адресата, будьте уверены мы организуем повторную доставку</Text>
            },
            {
                key: 14,
                label: "В какие страны вы доставляете цветы?",
                children: <Text>Только на территории Российской Федерации</Text>
            },
            {
                key: 15,
                label: "Можно ли сделать доставку в нерабочее время или ночью?",
                children: <Text>Да, мы работаем 24 часа в сутки</Text>
            },
            {
                key: 16,
                label: "Можете ли вы сделать доставку в отдаленный населенный пункт, отсутствующий у вас на сайте?",
                children: <Text>Да,но доставка будет платной в связи с тем, что наша курьерская служба доставляет бесплатно только в черте города,в котором находится наш склад </Text>
            },
            {
                key: 17,
                label: "Какие вы даете гарантии доставки моего заказа?",
                children: <Text>Наши менеджеры пришлют вам смс уведомления о доставке (и вышлют фото с получателем)</Text>
            }
        ]
    },
    {
        title: "Личный кабинет",
        helpItems: [
            {
                key: 18,
                label: "Как войти в личный кабинет?",
                children: <Text>Для входа в личный кабинет понадобится электронная почта и пароль</Text>
            },
            {
                key: 19,
                label: "Что делать, если утерян пароль для входа в личный кабинет?",
                children: <Text>Нужно нажать на кнопку "Забыл пароль", ввести электронную почту, к которой привязан личный кабинет. На почту придет письмо с данными для сброса пароля</Text>
            }
        ]
    },
    {
        title: "Акции и бонусная программа",
        helpItems: [
            {
                key: 20,
                label: "Есть ли у вас система скидок?",
                children: <Text>Дарим скидку 5% на первый заказ </Text>
            }
        ]
    },
    {
        title: "Партнёрам",
        helpItems: [
            {
                key: 21,
                label: "Как начать сотрудничество?",
                children: <Text>По всем вопросам обращайтесь по номеру <a style={{textDecoration: "none", fontFamily: "Inter", fontSize: 16, fontWeight: 400,color: "#FF749F" }} href="tel:+79869869996">+7 (986) 986 99 96</a></Text>
            }
        ]
    },
    {
        title: "Полезная информация",
        helpItems: [
            {
                key: 22,
                label: "Особенности ухода за срезанными цветами",
                children: <Text>{`Живые цветы создают праздничную атмосферу. Всего один маленький букетик на крестинах, новоселье или дне рождения способен поднять гостям настроение и оставить у них приятные впечатления о вечере. Подаренные цветы вы можете сразу ставить в вазу — они уже обработаны флористом. Однако чтобы букет простоял как можно дольше, советуем воспользоваться рекомендациями из этой статьи. Конечно, все индивидуально: одни сорта цветов остаются свежими дольше других. Но есть несколько общих правил, выполнение которых сохранит свежесть срезанных растений.`}</Text>
            },
            {
                key: 23,
                label: "Советы по уходу",
                children: 
                    <div>
                        <Text>{
                            `Не переносите букет сразу из холода в тепло. Резкая смена температуры вредит цветам, от этого они быстрее вянут. Если вы принесли цветы с улицы в отапливаемый дом, сначала оставьте их на прохладной веранде, в вестибюле. Дайте растениям привыкнуть к повышению температуры. Лишь после этого можно начать обработку стеблей.
                            Как только вы получили в подарок букет или сами приобрели его для украшения интерьера, позаботьтесь о состоянии растений. Магазинные цветы уже подготовлены к вазе: в нижней части стебля шипы и листья удалены, сам стебель аккуратно подрезан. Однако купленные растения часто обезвожены, поэтому им нужно помочь. Поместите букет под струю воды и обновите срезы на стеблях . Затем удалите нижние листья  и поставьте цветы в вазу с теплой водой. На растениях с мягким стеблем надо сделать длинный косой срез  — он увеличивает площадь поглощения влаги.
                            Следите за температурой в комнате. Букет необходимо поставить в светлое помещение, но не под прямые солнечные лучи. Избегайте сквозняков. Температура воздуха должна быть умеренной: при +18 °С срезанные растения стоят дольше, чем при +22 °С. Ночью лучше всего переставить вазу в прохладное место (идеальная температура — в пределах от +10 °С до +15 °С) или завернуть букет в бумагу и поместить в ведро с водой.
                            Периодически доливайте в вазу свежую воду. Это особенно важно в жаркое время года и в домах с низкой влажностью воздуха. Ведь там жидкость не только поглощается цветами, но и быстро испаряется.
                            Растения с длинными тычинками будут жить дольше, если эти тычинки удалить. Их можно вырвать руками или отрезать с помощью ножниц.
                            Чтобы продлить жизнь цветов, можно добавить в воду удобрения, дезинфицирующие средства, раствор аммония (все это продается в специализированных магазинах) или обычный сахар .
                            Опрыскивайте букет водой из пульверизатора , чтобы он дольше оставался ароматным и свежим.`
                        }</Text>
                        <Text>{
                            ` Некоторые растения имеют на стебле несколько соцветий. Такие букеты простоят дольше, если вы будете вовремя удалять засохшие цветки. Благодаря этому бутоны раскрываются полностью.
                            Существуют цветы, которые лучше не ставить вместе в одну вазу. Например, розы и гвоздики будут «конфликтовать» между собой и быстро завянут. Навредить другим растениям может и душистый горошек. Резеда, ландыши и нарциссы тоже ускорят увядание своих «соседей». А вот веточка ясменника, герани или туи, наоборот, продлит жизнь другим цветам в вазе.
                            Часто при оформлении букета флористы используют зелень и цветы кустарников. Уход за ними немного отличается от ухода за растениями с травянистым стеблем. Ветки больших кустарников имеют жесткий стебель, покрытый корой. Они могут быть уже обработаны, тогда их нужно просто поставить в вазу. Однако нередко такие ветки стоит самостоятельно подготовить к воде. Для этого надо отсечь нижние отростки  и подрезать стебель под косым углом. Снизу нужно сделать надрез и снять кору. Затем расщепить голый стебель на 2-3 части , взять молоток и раздробить приблизительно 2,5 см для увеличения площади впитывания .
                            Секреты ухода за разными растениями
                            При составлении букетов флористы используют многочисленные сорта цветов. Уход за ароматной композицией во многом зависит от вида растения. Расскажем о некоторых приемах.`
                        }</Text>
                        <div style={{height: 18}}></div>
                        <Text>{
                            `Самым популярным цветком для букетов является роза. Перед тем как поставить ее в вазу, необходимо срезать лишние листья и шипы . Стоит отметить, что у купленных роз они, как правило, уже удалены. Кроме того, есть сорта, у которых вообще нет шипов.`
                        }</Text>
                    </div>
            }
        ]
    }
]