import { styled } from "styled-components";
import Container from "../../../../shared/ui/containerMain/ContainerMain"
import { PHONE } from "../../../../shared/utils/constants";

const Title = styled.h2`
    font-family: "Inter";
    font-weight: 600;
    font-size: 32px;
    color: var(--secondary-text-color);
`;

const Text = styled(Title)`
    font-weight: 400;
    font-size: 16px;
`;

const AboutUs: React.FC = () => {
    return(
        <Container style={{margin: "0 auto", flexGrow: 3, padding: "35px 0"}}>
            <Title>О нас</Title>
            <Text>
                Уже не один год мы работаем в области флористики. 
                За это время мы получили сотни положительных отзывов о наших цветах. 
                Мы реализуем самые оригинальные букеты, которые не оставляют никого равнодушными. 
                Мы очень ценим свою репутацию, поэтому предлагаем нашим покупателям только свежие цветы.
            </Text>
            <Text>
                У нас самые опытные и вежливые менеджеры, которые всегда помогут с выбором нужного 
                букета под любое событие и в дальнейшем сориентируют по вашему заказу. Мы с уверенностью 
                можем сказать, что являемся лучшими в своем деле и всегда качественно, оригинально и 
                ответственно подходим к каждому заказу. 
            </Text>
            <Text>
                Наши постоянные клиенты советуют нас родным и друзьям. И это важное достижение, а значит, 
                мы делаем все правильно и отлично. Мнение о нашей работе и продукции очень важно для нас. 
                Вследствие чего, мы очень стараемся, а также выполняем заказ до тех пор, пока он в целом 
                и полностью не удовлетворит каждого клиента.
            </Text>
            <Title style={{fontSize: 20}}>Основные преимущества работы с сервисом Flowers Mega</Title>
            <Title style={{fontSize: 16}}>Удобно</Title>
            <ul style={{padding: "0 15px", display: "flex", flexDirection: "column", gap: 10}}>
                <li><Text>Развитая сеть доставки: Мы доставляем ваши эмоции и чувства даже в самые далекие уголки России. Мы с радостью вручим ваш букет в любой точке России;</Text></li>
                <li><Text style={{ display: "flex", gap: 5}}>Круглосуточный контактный центр: В любое время вы можете уточнить любые детали вашего заказа по бесплатному номеру <Text style={{fontSize: 18, fontWeight: 600, display: "flex"}}>{PHONE}<Text>;</Text></Text></Text></li>
                <li><Text>Автоматическая система расчета заказа: Мы всегда онлайн сообщим вам конечную стоимость и букета, и его доставки. И не потребуем доплат;</Text></li>
            </ul>
            <Title style={{fontSize: 16}}>Надежно</Title>
            <ul style={{padding: "0 15px", display: "flex", flexDirection: "column", gap: 10}}>
                <li><Text>Защита персональной информации: Все ваши персональные данные будут под нашей надежной защитой. Мы всегда заботимся о вашей приватности;</Text></li>
                <li><Text>Гарантия качества цветов: Мы тщательно проверяем каждый цветок, из которых составляются наши букеты. И если вы останетесь недовольны - переделаем заказ;</Text></li>
                <li><Text>Фотоконтроль: По вашему желанию флорист сфотографирует букет перед отправкой, а курьер сделает фото получателя с вашим подарком;</Text></li>
            </ul>
            <Title>Почему мы?</Title>
            <div style={{display: "flex", flexDirection: "column", gap: 30}}>
                <div style={{display: "flex", flexDirection: "column", gap: 10}}>
                    <Title style={{fontSize: 20}}>Широкий ассортимент</Title>
                    <Text>Наш сайт может предложить огромный выбор различных видов цветов, букетов и композиций. Это позволит Вам найти именно то, что Вам нужно, и выбрать из множества вариантов.</Text>
                </div>
                <div style={{display: "flex", flexDirection: "column", gap: 10}}>
                    <Title style={{fontSize: 20}}>Удобство и доступность</Title>
                    <Text>Наш сайт предоставляет удобную платформу для покупателей, где они могут выбирать и заказывать цветы в любое время и из любого места с доступом к Интернету. Они не ограничены географически и могут получить цветы в любой точке России.</Text>
                </div>
                <div style={{display: "flex", flexDirection: "column", gap: 10}}>
                    <Title style={{fontSize: 20}}>Быстрая доставка</Title>
                    <Text>Наш сайт может предложить быструю и надежную доставку цветов. Это особенно важно для случаев, когда Вы хотите отправить цветы в определенный день или к определенному событию, такому как день рождения или юбилей.</Text>
                </div>
                <div style={{display: "flex", flexDirection: "column", gap: 10}}>
                    <Title style={{fontSize: 20}}>Персонализация</Title>
                    <Text>Мы предлагаем услуги персонализации, позволяющие покупателям добавить к заказу дополнительные подарки, написать персональное поздравление или выбрать определенный способ оформления букета. Это создает более индивидуальный и особенный опыт для получателя.</Text>
                </div>
            </div>
        </Container>
    )
}

export default AboutUs;