import Container from "../../../../shared/ui/containerMain/ContainerMain";
import { Title } from "../../../../shared/ui/forAdditionalPages/Title";
import { Text } from "../../../../shared/ui/forAdditionalPages/Content";
import { PHONE } from "../../../../shared/utils/constants";

const PaymentDelivery: React.FC = () => {
    return(
        <Container style={{margin: "0 auto", flexGrow: 3, padding: "35px 0"}}>
            <Title>Оплата</Title>
            <div style={{display: "flex", flexDirection: "column", gap: 32}}>
                <div style={{display: "flex", flexDirection: "column", gap: 20}}>
                    <Title style={{fontSize: 20}}>Оплата на карту Сбербанка, Тинькофф</Title>
                    <Text>Заказ оплачивается на российскую карту физ. лица Сбербанк,Тинькоф. Минимальная сумма заказа 2000Р. В некоторых случаях счет на оплату заказа может быть выставлен на несколько карт.</Text>
                </div>

                <div style={{display: "flex", flexDirection: "column", gap: 24}}>
                    <Title style={{fontSize: 20}}>Оплата на Расчетный счет без НДС.</Title>
                    <Text>Минимальная сумма заказа 2000 рублей. Необходимо оплатить в течении часа</Text>
                </div>

                <div style={{display: "flex", flexDirection: "column", gap: 24}}>
                    <Title style={{fontSize: 20}}>Условия оплаты</Title>
                    <Text>Перед тем, как производить оплату, ознакомьтесь со следующей информацией: После создания заказа на нашем сайте, с вами свяжется менеджер и вам будут отправлены реквизиты для проведения оплаты за выбранные товары;</Text>
                    <Text>Все переводы на нашу карту осуществляются в рублях.</Text>
                </div>

                <div style={{display: "flex", flexDirection: "column", gap: 24}}>
                    <Title style={{fontSize: 20}}>Возврат и замена букета</Title>
                    <Text>Согласно закону РФ №2300-1 «О защите прав потребителей» и Постановлению Правительства РФ №55, горшечные и срезанные цветы не подлежат обмену и возврату. Однако мы решаем все возникающие вопросы в индивидуальном порядке и осуществляем замену и возврат в следующих случаях:</Text>
                    <Text>Без предоплаты, как только пришлём фото цветов, и все устроит-оплачиваете. Если вам не понравиться букет или что-то не устроит мы обязательно переделаем. После получения цветы завяли. (если вы следовали всем инструкциям по уходу за цветами, и они завяли меньше чем за сутки, заменим на другие цветы) Покупатель Интернет-магазина имеет право отказаться от получения товара в момент доставки, если доставлен товар ненадлежащего качества (на основании п.3 ст. 497 ГК РФ, статья 21 Закона «О защите прав потребителей»).</Text>
                    <Text>Получая фото-отчет от флориста вы соглашаетесь с условиями компании. После доставки букета в случае если цветок пришёл в негодность по вашей вине возврат не может быть осуществлён.</Text>
                </div>
            </div>
            <Title>Доставка</Title>
            <div style={{display: "flex", flexDirection: "column", gap: 32}}>
                <div  style={{display: "flex", flexDirection: "column", gap: 20}}>
                    <Title style={{fontSize: 20}}>Заказав доставку цветов в Flowers Mega, Вы можете быть уверены в том, что Ваш букет будет доставлен вовремя и в идеальном состоянии!</Title>
                    <Text style={{display: "flex", flexWrap: "wrap", gap: 5}}>
                        В Flowers Mega, Вы можете оформить недорого 
                        <Text style={{width: "fit-content", borderBottom: "1px solid var(--secondary-text-color)"}}>заказ цветов с доставкой</Text> 
                        <Text>по всей России.</Text> Это означает, что любой букет, который находится в каталоге нашего интернет-магазина, может быть доставлен нашим курьером на дом или в офис по указанному адресу, т.е. в любую точку России в удобное для Вас время. Мы торжественно вручим букет от Вашего имени или неизвестного незнакомца/незнакомки (в случае, если Вы пожелаете оставаться инкогнито).</Text>
                </div>
                <div  style={{display: "flex", flexDirection: "column", gap: 20}}>
                    <Title style={{fontSize: 20}}>Информация о платной доставке</Title>
                    <Title style={{fontSize: 16}}>Платная доставка осуществляется по следующим городам:</Title>
                    <Text style={{padding: "0 15px"}}>
                        <ul>
                            <li>Томск</li>
                            <li>Томск</li>
                            <li>Томск</li>
                            <li>Томск</li>
                        </ul>
                    </Text>
                    <Text>Доставка в ночное время с 00:00 до 08:00 рассчитывается по ставке 290 рублей. Доставка к точному времени (+/- 15 мин) = 500 рублей.</Text>
                    <Text>Доставка на 31 декабря и 1 января оплачивается отдельно. Стоимость 500р. Способ "Оплата курьеру" - не доступен в эти дни.</Text>
                    <Text>Как оформить? Просто выбираете букет как обычно и если у вас доставка оформляется на эти даты - то с вами свяжется менеджер для согласования доплаты за эти даты.</Text>
                    <Text>Повторная доставка, по причине отсутствия получателя на месте в указанноме заказчиком время, оплачивается заказчиком отдельно в зависимости от района города.</Text>
                    <Text>{`Оформить заказ букетов с доставкой Вы можете непосредственно на нашем сайте или по телефону ${PHONE} (бесплатно для РФ). Прием звонков ведется ЕЖЕДНЕВНО с 08:00 до 23:00.`}</Text>
                    <Text>Компания «Flowers Mega» старается сделать все для комфортной работы с клиентами. Поэтому заказанную Вами продукцию на нашем сайте, Вы без труда можете оплатить любым удобным способом: картой, наличными, курьеру и т.д.</Text>
                </div>
            </div>
        </Container>
    )
}

export default PaymentDelivery;